Repository: hiwajamil/rehanrose.com
Catalog: gull_premium/lib/l10n/app_*.arb
Languages: ar, ku

# adminStudio
source: Studio
ku: ئستۆدیۆ

# adminOwner
source: Owner
ku: خاوەن

# adminEmail
source: Email
ku: ئیمەیڵ

# adminPhone
source: Phone
ku: تەلەفۆن

# adminLocation
source: Location
ku: شوێن

# adminApprove
source: Approve
ku: پەسەند بکە

# adminReject
source: Reject
ku: ڕەت بکەرەوە

# adminWorking
source: Working...
ku: کار کرا…

# adminApplicationApproved
source: Application approved.
ku: داواکاری پەسەندکرا.

# adminApplicationRejected
source: Application rejected.
ku: داواکاری ڕەتکرایەوە.

# adminUnableToApprove
source: Unable to approve application.
ku: پەسەندکردنی داواکاری سەرکەوتوو نەبوو.

# adminUnableToReject
source: Unable to reject application.
ku: ڕەتکردنەوەی داواکاری سەرکەوتوو نەبوو.
