Repository: hiwajamil/rehanrose.com
Catalog: gull_premium/lib/l10n/app_*.arb
Languages: ar, ku

# navFlowers
source: Flowers
ar: الورود
ku: گوڵ

# navOccasions
source: Occasions
ar: المناسبات
ku: بۆنەکان

# navVendors
source: Vendors
ar: البائعون
ku: فرۆشیاران

# navAbout
source: About
ar: عن
ku: دەربارە

# navOffers
source: Offers
ar: العروض
ku: پێشکەشەکان

# navFlorists
source: Florists
ar: بائعو الورود
ku: گوڵفروشەکان

# navTrackOrder
source: Track Order
ar: تتبع الطلب
ku: شوێنکەوتنی داواکاری

# navHelp
source: Help
ar: المساعدة
ku: یارمەتی

# helpDeliveryAreas
source: Delivery Areas
ar: مناطق التوصيل
ku: ناوچەکانی گەیاندن

# helpContactUs
source: Contact Us
ar: اتصل بنا
ku: پەیوەندیمان پێوە بکە

# helpFaq
source: FAQ
ar: الأسئلة الشائعة
ku: پرسیارە باوەکان

# occasionsShopByRecipient
source: Shop by Recipient
ar: تسوق حسب المستلم
ku: بە وەرگر بکڕە

# occasionsForMom
source: For Mom
ar: للأم
ku: بۆ دایک

# occasionsForHer
source: For Her
ar: لها
ku: بۆ ئەو

# occasionsForHim
source: For Him
ar: له
ku: بۆ ئەو

# navOccasionBirthday
source: Birthday
ar: عيد الميلاد
ku: ڕۆژی لەدایکبوون

# trackOrderTitle
source: Track Your Order
ar: تتبع طلبك
ku: شوێنکەوتنی داواکاریەکەت

# trackOrderHint
source: Enter your Order ID to see status.
ar: أدخل معرف الطلب لمعرفة الحالة.
ku: کۆدی داواکاری بنووسە بۆ بینینی دۆخ.

# orderIdLabel
source: Order ID
ar: معرف الطلب
ku: کۆدی داواکاری

# trackOrderButton
source: Check Status
ar: تحقق من الحالة
ku: دۆخ بپشکنە

# orderNotFound
source: Order not found. Please check the ID.
ar: الطلب غير موجود. يرجى التحقق من المعرف.
ku: داواکاری نەدۆزرایەوە. تکایە کۆدەکە بپشکنە.

# orderStatusReceived
source: Received
ar: مستلم
ku: وەرگیرا

# orderStatusPreparing
source: Preparing
ar: قيد التحضير
ku: ئامادەکردن

# orderStatusOnTheWay
source: On the Way
ar: في الطريق
ku: لە ڕێگادا

# orderStatusDelivered
source: Delivered
ar: تم التوصيل
ku: گەیەندرا

# ctaBecomeVendor
source: Become a Vendor
ar: كن بائعاً
ku: ببە بە فرۆشیار

source: Sign In
ar: تسجيل الدخول
ku: چوونەژوورەوە

# heroTitlePart1
source: When words can't…
ar: عندما تعجز الكلمات…
ku: کاتێک وشەکان بێدەنگ دەبن...

# heroTitlePart2
source: Let flowers speak.
ar: دع الورود تتحدث.
ku: با گوڵەکان بدوێن

# heroSubtitle
source: Delivering your deepest emotions, in the most beautiful way.
ar: نوصل أعمق مشاعرك، بأجمل طريقة.
ku: هەستە قووڵەکانت بە جوانترین شێوە دەگەیەنین.

# heroTagline
source: Because some moments deserve more than words.
ar: لأن بعض اللحظات تستحق أكثر من الكلمات.
ku: چونکە هەندێک سات شایانی زیاتر لە ووتەن.

# emotionDropdownPrompt
source: What do you want to say today?
ar: ماذا تريد أن تقول اليوم؟
ku: چیت لە دڵدایە ئەمڕۆ ؟

# searchPlaceholder
source: Choose an emotion
ar: اختر شعوراً
ku: هەستێک هەڵبژێرە

# chooseEmotion
source: Choose an emotion
ar: اختر شعوراً
ku: هەستێک هەڵبژێرە

# emotionCelebrateThem
source: Celebrate Them
ar: احتفِ بهم
ku: ئاهەنگیان بگێڕە

# emotionForeverBegins
source: Forever Begins
ar: للأبد يبدأ
ku: هەتاهەتایی دەست پێ دەکات

# emotionImHere
source: I'm Here
ar: أنا هنا
ku: ئەمەم لەگەڵت

# emotionWithGratitude
source: With Gratitude
ar: بالامتنان
ku: بە سوپاسگوزی

# emotionJustBecause
source: Just Because
ar: لمجرد ذلك
ku: تەنها لەبەر ئەوە

# emotionWellDeserved
source: Well Deserved
ar: مستحق
ku: شایانی

# emotionStillYou
source: Still You
ar: ما زلت أنت
ku: هەر ئەوت

# emotionThinkingOfYou
source: Thinking of You
ar: أفكر بك
ku: بیرت دەکەمەوە

source: Flowers for every feeling.
ar: ورود لكل شعور.
ku: گوڵ بۆ هەموو هەستێک.

# eachBouquetCopy
source: Each bouquet is designed to say what your heart already feels.
ar: كل باقة مصممة لقول ما يشعر به قلبك بالفعل.
ku: هەر دەستەگوڵێک دروستکراوە بۆ ئەوەی ئەوە بڵێت کە دڵت هەڵیگرتووە.

source: Loading bouquets…
ar: جاري تحميل الباقات…
ku: دەستەگوڵەکان بار دەبن…

source: Could not load bouquets.
ar: تعذر تحميل الباقات.
ku: بارکردنی دەستەگوڵەکان سەرکەوتوو نەبوو.

source: Retry
ar: إعادة المحاولة
ku: دووبارە هەوڵ بدەرەوە

source: No bouquets yet.
ar: لا توجد باقات بعد.
ku: هێشتا دەستەگوڵ نییە.

# noBouquetsForFeeling
source: No bouquets for this feeling yet.
ar: لا توجد باقات لهذا الشعور بعد.
ku: هێشتا دەستەگوڵ بۆ ئەم هەستە نییە.

# reachedEndOfList
source: You've reached the end.
ar: وصلت إلى النهاية.
ku: گەیشتیت بە کۆتایی.

# noOffersYet
source: No offers at the moment.
ar: لا توجد عروض حالياً.
ku: هێشتا پێشکەش نییە.

# specialOffersTitle
source: Special Offers
ar: عروض خاصة
ku: پێشکەشە تایبەتەکان

# noOffersBrowseAll
source: No special offers right now. Browse our full collection below.
ar: لا توجد عروض خاصة حالياً. تصفح مجموعتنا الكاملة أدناه.
ku: ئێستا پێشکەشی تایبەت نییە. کۆکراوە تەواوەکەمان لە خوارەوە بگەڕێ.

source: Browse all bouquets
ar: تصفح كل الباقات
ku: هەموو دەستەگوڵەکان بگەڕێ

# carefullyCurated
source: Carefully curated. Thoughtfully delivered.
ar: مختارة بعناية، ومقدمة بكل حب.
ku: بە وردی هەڵبژێردراوە، بە خۆشەویستییەوە پێشکەش دەکرێت.

source: Same-day delivery
ar: توصيل في نفس اليوم
ku: گەیاندنی هەمان ڕۆژ

source: Trusted local florists
ar: بائعو ورود محليون موثوقون
ku: گوڵفروشە متمانەپێکراوە ناوخۆییەکان

source: Handcrafted bouquets
ar: باقات مصنوعة يدوياً
ku: دەستەگوڵی دەستی

# splashMission
source: We believe that every emotion deserves to arrive beautifully.
ar: نؤمن بأن كل شعور يستحق أن يصل بجمال.
ku: باوەڕمان وایە هەموو هەستێک شایانی گەیاندنی جوانە.

source: Something went wrong
ar: حدث خطأ ما
ku: هەڵەیەک ڕوویدا

# refreshOrTryAgain
source: Please refresh the page or try again later.
ar: يرجى تحديث الصفحة أو المحاولة لاحقاً.
ku: تکایە پەڕەک نوێ بکەرەوە یان دواتر دووبارە هەوڵ بدەرەوە.

# filterAll
source: All
ar: الكل
ku: هەموو

# ctaButton
source: Explore
ar: استكشف
ku: گەڕان

# microCopyFlowersThatSay
source: Flowers that say {label}
ar: ورود تقول {label}
ku: گوڵەکان کە دەڵێن {label}

# microCopyBouquetsFor
source: Bouquets for {label}
ar: باقات من أجل {label}
ku: دەستەگوڵ بۆ {label}

# cat_love
source: Love
ar: الحب
ku: خۆشەویستی

# cat_apology
source: I'm Sorry
ar: أنا آسف
ku: لێم ببورە

# cat_gratitude
source: Thank You
ar: شكر وتقدير
ku: سوپاسگوزاری

# cat_sympathy
source: Sympathy
ar: المواساة
ku: هاوخەمی

# cat_wellness
source: Get Well
ar: الشفاء العاجل
ku: سەلامەتی

# cat_celebration
source: Celebration
ar: الاحتفالات
ku: بۆنە و ئاهەنگ

# cat_birthday
source: Birthday
ar: عيد الميلاد
ku: ڕۆژی لەدایکبوون

# cat_anniversary
source: Anniversary
ar: ذكرى
ku: ساڵیادی

# cat_newborn
source: New Born
ar: مولود جديد
ku: منداڵی نوێ

# cat_wedding
source: Wedding
ar: زفاف
ku: ئاهەنگی هاوسەرگیری

# vendor_emotion_label
source: Primary Emotion
ar: الشعور الأساسي
ku: هەستی سەرەکی

# vendor_emotion_hint
source: Choose the primary emotion this flower conveys (e.g., do not select 'Love' for a funeral).
ar: اختر الشعور الذي تعبر عنه الزهرة.
ku: ئەو هەستە هەڵبژێرە کە گوڵەکە دەیگەیەنێت (تکایە گوڵی سور بۆ پرسە دیاری مەکە).

# home_question
source: What do you want to say today?
ar: ماذا تريد أن تقول اليوم؟
ku: دەتەوێت ئەمڕۆ چی بڵێیت؟

# makeItPerfectSectionTitle
source: Make it Perfect?
ar: أكمل هديتك
ku: دیارییەکەت تەواو بکە

# makeItSpecialSectionTitle
source: Make it Special
ar: اجعلها مميزة
ku: تایبەتی بکە

# addVaseLabel
source: Add Vase
ar: إضافة مزهرية
ku: گوڵدان زیاد بکە

# addChocolateLabel
source: Add Chocolate
ar: إضافة شوكولاتة
ku: چۆکلێت زیاد بکە

# addCardLabel
source: Add Card
ar: إضافة بطاقة
ku: کارت زیاد بکە

# selectLabel
source: Select
ar: اختر
ku: هەڵبژێرە

# totalPriceLabel
source: Total Price
ar: السعر الإجمالي
ku: کۆی گشتی

source: Order via WhatsApp
ar: طلب عبر واتساب
ku: داواکردن بە واتساپ

source: Includes Free Voice Message QR Code
ar: يتضمن رمز QR مجاني للرسالة الصوتية
ku: کۆدی QRی نامەی دەنگی بەخۆڕایی لەخۆدەگرێت

# addOnPersonalizationTitle
source: Add-on & Personalization
ar: الإضافات والتخصيص
ku: زیادە و تایبەتمەندی

# addOnAddButton
source: Add
ku: زیاد بکە

# addOnChooseVases
source: Choose a Vase
ku: گوڵدانێک هەڵبژێرە

# addOnChooseChocolates
source: Choose Chocolates
ku: چۆکلێت هەڵبژێرە

# addOnChooseCards
source: Choose a Card
ku: کارتێک هەڵبژێرە

# addOnChooseAddOn
source: Choose Add-on
ku: زیادەیەک هەڵبژێرە

source: Step 1: Add-ons
ar: الخطوة 1: الإضافات
ku: هەنگاو ١: زیادەکان

source: Step 2: Voice Message
ar: الخطوة 2: الرسالة الصوتية
ku: هەنگاو ٢: نامەی دەنگی

source: Step 3: Order
ar: الخطوة 3: الطلب
ku: هەنگاو ٣: داواکاری

source: Could not load product.
ar: تعذر تحميل المنتج.
ku: بارکردنی بەرهەم سەرکەوتوو نەبوو.

source: Product not found.
ar: المنتج غير موجود.
ku: بەرهەم نەدۆزرایەوە.

source: Voice message added
ar: تمت إضافة الرسالة الصوتية
ku: نامەی دەنگی زیادکرا

# addAmountMoreForFreeDelivery
source: Add {amount} IQD more to get FREE Delivery!
ku: {amount} دینار زیاتر زیاد بکە بۆ گەیاندنی بەخۆڕایی!

source: 🎉 You unlocked FREE Delivery!
ku: 🎉 گەیاندنی بەخۆڕایی کردیتەوە!

source: Pay with FIB
ar: الدفع بـ FIB
ku: پارە بدە بە FIB

# currencyIqd
source: IQD
ar: دینار
ku: دینار

# vendorDefaultName
source: Vendor
ar: بائع
ku: فرۆشیار

# vendorSearchBouquetHint
source: Search by bouquet code...
ar: البحث برمز الباقة...
ku: گەڕان بە کۆدی دەستەگوڵ...

source: Search
ar: بحث
ku: گەڕان

source: Cancel
ar: إلغاء
ku: پاشگەزبوونەوە

source: Online
ar: متصل
ku: سەرھێڵ

source: Offline
ar: غير متصل
ku: دەرەسەرھێڵ

source: Notifications
ar: الإشعارات
ku: ئاگاداریەکان

source: Profile
ar: الملف الشخصي
ku: پرۆفایل

source: Log out
ar: تسجيل الخروج
ku: چوونەدەرەوە

source: No new notifications.
ar: لا توجد إشعارات جديدة.
ku: ئاگاداری نوێ نییە.

source: Menu
ar: القائمة
ku: لیستە

# vendorNavDashboard
source: Dashboard
ar: لوحة التحكم
ku: داشبۆرد

# vendorNavOrders
source: Orders
ar: الطلبات
ku: داواکاریەکان

# vendorNavBouquets
source: Bouquets
ar: الباقات
ku: دەستەگوڵەکان

# vendorNavAddBouquet
source: Add Bouquet
ar: إضافة باقة
ku: دەستەگوڵ زیاد بکە

# vendorNavEarnings
source: Earnings
ar: الأرباح
ku: داهات

# vendorNavNotifications
source: Notifications
ar: الإشعارات
ku: ئاگاداریەکان

# vendorNavShopSettings
source: Shop Settings
ar: إعدادات المتجر
ku: ڕێکخستنی فرۆشگا

# vendorNavSupport
source: Support
ar: الدعم
ku: پشتگیری

# vendorDashboardTitle
source: Dashboard
ar: لوحة التحكم
ku: داشبۆرد

# vendorTodaysOrders
source: Today's Orders
ar: طلبات اليوم
ku: داواکاریەکانی ئەمڕۆ

# vendorPendingOrders
source: Pending Orders
ar: طلبات قيد الانتظار
ku: داواکاری چاوەڕوان

# vendorTodaysRevenue
source: Today's Revenue
ar: إيرادات اليوم
ku: داهاتی ئەمڕۆ

# vendorShopStatus
source: Shop Status
ar: حالة المتجر
ku: دۆخی فرۆشگا

# vendorAlerts
source: Alerts
ar: التنبيهات
ku: ئاگاداریەکان

# vendorNoOrdersNeedingConfirmation
source: No orders needing confirmation.
ar: لا توجد طلبات تحتاج تأكيد.
ku: هیچ داواکاریەک پێویستی بە ڕەزامەندی نییە.

# vendorNoNewAdminNotices
source: No new admin notices.
ar: لا توجد إشعارات جديدة من الإدارة.
ku: ئاگاداری نوێی بەڕێوەبەرانی نییە.

# vendorActiveBouquets
source: Active Bouquets
ku: دەستەگوڵە چالاکەکان

# vendorPendingApprovals
source: Pending Approvals
ku: چاوەڕوانی پەسەندکردن

# vendorTotalViewsClicks
source: Total Views / Clicks
ku: کۆی بینین و کرتەکان

# vendorMotivationGreatJob
source: Great job! Your shop is looking beautiful.
ku: کارەکەت زۆر باشە! فرۆشگاکەت زۆر جوانە.

# vendorMotivationMoreBouquets
source: Add more beautiful bouquets to attract more customers!
ku: دەستەگوڵی زیاتر زیاد بکە بۆ ڕاکێشانی کڕیاران!

# footerTagline
source: Delivering emotions, one flower at a time.
ar: نوصل المشاعر، وردة بواحدة.
ku: هەستەکان دەگەیەنین، گوڵ بە گوڵێک.

# footerHelpCenter
source: Help Center
ar: مركز المساعدة
ku: ناوەندی یارمەتی

# footerFlowerCareGuide
source: Flower Care Guide
ar: دليل العناية بالورود
ku: ڕێنمایی چاودێری گوڵ

# footerFaqs
source: FAQs
ar: الأسئلة الشائعة
ku: پرسیارە باوەکان

# footerAboutUs
source: About Us
ar: عنّا
ku: دەربارەی ئێمە

# aboutStoryHeading
source: Why we started Rehan Rose
ar: لماذا أنشأنا Rehan Rose
ku: بۆچی Rehan Roseمان دامەزراند

# vendorSignupHeadline
source: Become a Rehan Rose florist
ar: انضم كبائع ورد في Rehan Rose
ku: ببە بە گوڵفروشی Rehan Rose

# footerBecomeFlorist
source: Become a Florist
ar: كن بائع ورد
ku: ببە بە گوڵفروش

# footerPrivacyTerms
source: Privacy Policy & Terms
ar: الخصوصية والشروط
ku: سیاسەتی تایبەتمەندی و مەرجەکان

# footerContactUs
source: Contact Us
ar: اتصل بنا
ku: پەیوەندیمان پێوە بکە

# footerChatOnWhatsApp
source: Chat on WhatsApp
ar: تواصل عبر واتساب
ku: چات لە واتساپ

# footerAddress
source: Sulaymaniyah, Iraq
ar: السليمانية، العراق
ku: سلێمانی، عێراق

# footerCopyright
source: © {year} Rehan Rose. All rights reserved.
ar: © {year} Rehan Rose. جميع الحقوق محفوظة.
ku: © {year} Rehan Rose. هەموو مافەکان پاراستراوە.

# footerDeliveryZones
source: Delivery Locations
ar: مناطق التوصيل
ku: ناوچەکانی گەیاندن

# footerDeliveryZonesIntro
source: We deliver to the following areas:
ar: نوصّل إلى المناطق التالية:
ku: ئێمە بۆ ئەم ناوچانە گەیاندن دەکەین:

# flowerCareGuideIntro
source: Simple tips to keep your flowers fresh longer:
ar: نصائح بسيطة لإبقاء ورودك طازجة لفترة أطول:
ku: ئامۆچۆیەکی سادە بۆ پاراستنی گوڵەکانت بۆ ماوەیەکی درێژتر:

# flowerCareTipWater
source: Change water daily
ar: غيّر الماء يومياً
ku: ئاوەکە ڕۆژانە بگۆڕە

# flowerCareTipSun
source: Keep away from direct sun
ar: ابتعد عن أشعة الشمس المباشرة
ku: دوور بکەوە لە ڕووناکی ڕاستەوخۆی خۆر

# flowerCareTipStems
source: Trim stems
ar: قص السيقان
ku: قەدەکان بڕین

# faqPaymentQuestion
source: What payment methods do you accept?
ar: ما طرق الدفع المتاحة؟
ku: چ جۆر پارەدانێکتان هەیە؟

# faqPaymentAnswer
source: We accept FastPay, ZainCash, FIB, and Visa. You can also pay via WhatsApp for your convenience.
ar: نقبل فاست باي، زين كاش، FIB، وفيزا. يمكنك أيضاً الدفع عبر واتساب.
ku: فاستپەی، زەینکاش، FIB، و ڤیزا واتەپەش قبووڵ دەکەین. دەتوانیت بە واتساپ پارە بدەیت.

# faqDeliveryQuestion
source: How long does delivery take?
ar: كم تستغرق التوصيلة؟
ku: گەیاندن چەند دەخایەنێت؟

# faqDeliveryAnswer
source: We offer same-day delivery in supported areas. Orders placed before noon are typically delivered the same day; otherwise the next day.
ar: نقدم توصيلاً في نفس اليوم ضمن المناطق المدعومة. الطلبات قبل الظهر تُسلّم عادةً في نفس اليوم، وإلا في اليوم التالي.
ku: گەیاندنی هەمان ڕۆژ لە ناوچە پشتیوانکراوەکاندا دابین دەکەین. داواکارییەکانی پێش نیوەڕۆ بە شێوەیەکی ئاسایی هەمان ڕۆژ دەگەن؛ وەکەها ڕۆژی دواتر.

# faqReturnsQuestion
source: What is your return policy?
ar: ما سياسة الإرجاع؟
ku: سیاسەتی گەڕانەوە چییە؟

# faqReturnsAnswer
source: Due to the perishable nature of flowers, we cannot accept returns. If your order arrives damaged or incorrect, please contact us within 24 hours with photos and we will make it right.
ar: بسبب طبيعة الورود القابلة للتلف، لا نستطيع قبول الإرجاع. إن وصل الطلب تالفاً أو خاطئاً، تواصل معنا خلال 24 ساعة مع صور وسنصلح الأمر.
ku: بەهۆی سروشتی گوڵەکان، ناتوانین گەڕانەوە وەربگرین. ئەگەر داواکاریەکەت تێکچوو یان هەڵە گەیشت، لە 24 کاتژمێرەوە پەیوەندیمان پێوە بکە لەگەڵ وێنە و چاکی دەکەین.

# legalPrivacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية
ku: سیاسەتی تایبەتمەندی

# legalTermsOfServiceTitle
source: Terms of Service
ar: شروط الخدمة
ku: مەرجەکانی خزمەتگوزاری

# legalPrivacyIntro
source: Rehan Rose ("we") respects your privacy. This policy describes how we collect, use, and protect your information when you use our platform.
ar: تحترم Rehan Rose ("نحن") خصوصيتك. تصف هذه السياسة كيفية جمعنا لمعلوماتك واستخدامها وحمايتها عند استخدام منصتنا.
ku: Rehan Rose ("ئێمە") ڕێز لە تایبەتمەندیەکەت دەگرێت. ئەم سیاسەتە باس لە چۆنیەتی کۆکردنەوە، بەکارهێنان و پاراستنی زانیاریەکەت دەکات کاتێک پلاتفۆرمەکەمان بەکاردەهێنیت.

# legalPrivacyData
source: We collect information you provide when ordering (name, delivery address, phone, email), account details if you sign in or register as a vendor, and usage data such as device and browsing information to improve our service.
ar: نجمع المعلومات التي تقدمها عند الطلب (الاسم، عنوان التوصيل، الهاتف، البريد الإلكتروني)، وتفاصيل الحساب إن سجّلت الدخول أو كبائع، وبيانات الاستخدام مثل الجهاز وتصفح الموقع لتحسين خدمتنا.
ku: زانیاری ئەوەی کۆدەکەینەوە کە کاتێک داواکاری دەکەیت دەیپێدیت (ناو، ناونیشانی گەیاندن، تەلەفۆن، ئیمەیڵ)، وردەکاری هەژمار ئەگەر چوونەژوورەوە یان وەک فرۆشیار تۆمار بکەیت، و زانیاری بەکارهێنان وەک ئامێر و زانیاری گەڕان بۆ باشترکردنی خزمەتگوزاریمان.

# legalPrivacyUse
source: We use this information to process orders, communicate with you, improve our website and services, and comply with legal obligations.
ar: نستخدم هذه المعلومات لمعالجة الطلبات، والتواصل معك، وتحسين موقعنا وخدماتنا، والالتزام بالالتزامات القانونية.
ku: ئەم زانیاریە بەکاردەهێنین بۆ ڕێکخستنی داواکاریەکان، پەیوەندی لەگەڵت، باشترکردنی ماڵپەڕ و خزمەتگوزاریەکان، و ڕێکەوتن لەگەڵ ئەرکە یاساییەکان.

# legalPrivacySharing
source: We do not sell your personal data. We may share information with delivery partners and service providers necessary to fulfil orders and operate the platform, under strict confidentiality.
ar: لا نبيع بياناتك الشخصية. قد نشارك معلومات مع شركاء التوصيل ومقدمي الخدمات اللازمين لتنفيذ الطلبات وتشغيل المنصة، بسرية تامة.
ku: زانیاری کەسی تۆ نافرۆشین. ڕەنگە زانیاری لەگەڵ هاوکارانی گەیاندن و دابینکەرانی خزمەتگوزاری پێویست بۆ جێبەجێکردنی داواکاری و بەڕێوەبردنی پلاتفۆرم هاوبەش بکەین، لەژێر ڕازێکی تەواودا.

# legalPrivacyContact
source: For privacy-related questions, contact us at the email or address provided in the footer.
ar: لأسئلة الخصوصية، تواصل معنا على البريد أو العنوان المذكور في التذييل.
ku: بۆ پرسیارە پەیوەندیدارەکان بە تایبەتمەندی، لە ڕێگەی ئیمەیڵ یان ناونیشانی لە پاشپەڕەکەدا پەیوەندیمان پێوە بکە.

# legalTermsIntro
source: By using Rehan Rose, you agree to these Terms of Service. Please read them carefully.
ar: باستخدام Rehan Rose، فإنك توافق على شروط الخدمة هذه. يرجى قراءتها بعناية.
ku: بە بەکارهێنانی Rehan Rose، ڕازیت بە ئەم مەرجەکانی خزمەتگوزاریە. تکایە بە وریایی بخوێنەرەوە.

# legalTermsUse
source: You may use our platform for lawful purposes only. You must provide accurate information when placing orders and not misuse the service (e.g. fraud, harassment, or violating applicable laws).
ar: يمكنك استخدام منصتنا لأغراض قانونية فقط. يجب تقديم معلومات دقيقة عند الطلب وعدم إساءة استخدام الخدمة (مثل الاحتيال أو المضايقة أو مخالفة القوانين المعمول بها).
ku: تەنها دەتوانیت پلاتفۆرمەکەمان بۆ مەبەستە یاساییەکان بەکاربهێنیت. دەبێت زانیاری ڕاست بدەیت کاتێک داواکاری دەکەیت و خزمەتگوزاریەکە بە ناڕەواتی بەکارمەهێنیت (وەک فریودان، ڕاوەستان، یان پێشێلکردنی یاسا پەیوەندیدارەکان).

# legalTermsOrders
source: Orders are subject to availability and acceptance. Pricing and delivery terms are as shown at checkout. We and our florist partners aim to deliver fresh, quality bouquets; specific guarantees are as stated on the product and checkout pages.
ar: الطلبات خاضعة للتوفر والقبول. الأسعار وشروط التوصيل كما تظهر عند الدفع. نحن وشركاؤنا بائعو الورود نهدف لتوصيل باقات طازجة وجودة؛ الضمانات المحددة كما هي مذكورة في صفحات المنتج والدفع.
ku: داواکاریەکان لەژێر بەردەستبوون و قبووڵکردندان. نرخ و مەرجەکانی گەیاندن وەک لە کاتەی تەواوکردنی کڕین پیشان دەدرێت. ئێمە و هاوکارە گوڵفروشەکانمان ئامانجمان گەیاندنی دەستەگوڵی بەتازە و کوالیتی باشە؛ دڵنیاییە تایبەتەکان وەک لە پەڕەکانی بەرهەم و تەواوکردنی کڕین ڕێکخراون.

# legalTermsContact
source: For questions about these terms, contact us using the details in the footer. We may update these terms from time to time; continued use after changes constitutes acceptance.
ar: لأسئلة حول هذه الشروط، تواصل معنا باستخدام التفاصيل في التذييل. قد نحدّث هذه الشروط من وقت لآخر؛ الاستمرار بالاستخدام بعد التحديثات يُعد موافقة.
ku: بۆ پرسیارەکان دەربارەی ئەم مەرجانە، لە ڕێگەی وردەکارییەکانی لە پاشپەڕەکەدا پەیوەندیمان پێوە بکە. ڕەنگە ئەم مەرجانە لە کاتێکەوە بۆ کاتێک نوێ بکەینەوە؛ بەردەوامبوونی بەکارهێنان دوای گۆڕانکاری ڕازبوونە.

# aboutStoryParagraph1
source: Rehan Rose started from a simple belief: every bouquet should carry the care of a real florist and the freshness of flowers that were chosen and arranged by hand. We wanted to bring that experience to you—without the middleman, without the long supply chains.
ar: انطلق Rehan Rose من إيمان بسيط: أن تحمل كل باقة عناية بائع ورد حقيقي وطراوة ورود اختُيرت ورُتّبت باليد. أردنا أن نوصّل لك تلك التجربة—بدون وسيط، وبدون سلاسل توريد طويلة.
ku: Rehan Rose لە باوەڕێکی سادەوە دەستی پێکرد: هەر دەستەگوڵێک دەبێت چاودێری گوڵفروشێکی ڕاستەقینە و بەتازەیی گوڵەکانی هەڵبژێردراو و ڕێکخراوەتەوە بە دەست هەڵبگرێت. ویستمان ئەو ئەزموونە بگەیەنینە پێت—بەبێ ناوەند، بەبێ زنجیرە دابینکردنە درێژەکان.

# aboutStoryParagraph2
source: That's why we work only with local florists. Each bouquet on Rehan Rose is made by a florist in your region—people who know the seasons, the flowers, and the craft. When you order from us, you're supporting small businesses and getting flowers that were prepared the same day, not shipped from far away.
ar: لذلك نعمل فقط مع بائعي ورود محليين. كل باقة على Rehan Rose يصنعها بائع ورد في منطقتك—أشخاص يعرفون الفصول والورود والحرفة. عندما تطلب منا، أنت تدعم المشاريع الصغيرة وتحصل على ورود جُهّزت في نفس اليوم، لا شُحنت من بعيد.
ku: بۆیە تەنها لەگەڵ گوڵفروشە ناوخۆییەکان کار دەکەین. هەر دەستەگوڵێک لە Rehan Rose لەلایەن گوڵفروشێک لە ناوچەکەتەوە دروست دەکرێت—کەسانی کە وەرزەکان، گوڵەکان و پیشەکە دەناسن. کاتێک لە ئێمە داواکاری دەکەیت، پشتگیری بازرگانی بچووک دەکەیت و گوڵی ئەو ڕۆژە وەردەگریت، نەک گەیەندراو لە دوورەوە.

# aboutStoryParagraph3
source: Fresh flowers, local talent, and a platform that connects you to both—that's the story behind Rehan Rose. Thank you for being part of it.
ar: ورود طازجة، موهبة محلية، ومنصة تربطك بهما—هذه قصة Rehan Rose. شكراً لكونك جزءاً منها.
ku: گوڵی بەتازە، توانای ناوخۆیی، و پلاتفۆرمێک کە پەیوەندیت پێوە دەکات بە هەردووکیان—ئەوە چیرۆکی پشت Rehan Roseە. سوپاس بۆ ئەوەی بەشێکی.

source: No Internet Connection
ar: لا يوجد اتصال بالإنترنت
ku: هیچ پەیوەندییەک بە ئینتەرنێت نییە

source: Back Online
ar: عودة الاتصال
ku: گەڕانەوە بۆ ئۆنلاین

# adminSuperAdminDashboard
source: Super Admin Dashboard
ku: داشبۆردی بەڕێوەبەری سەرەکی

# adminSignInPrompt
source: Sign in to review vendor applications. If you see "Access restricted", add your UID to the admins collection in Firestore (instructions shown there).
ku: چوونەژوورەوە بکە بۆ پشکنینی داواکارییەکانی فرۆشیاران. ئەگەر «دەستڕاگەیشتن سنووردارە» دەبینیت، UIDی خۆت زیاد بکە بۆ کۆکراوەی admins لە Firestore (ڕێنماییەکان پیشان دەدرێن).

# adminEmailLabel
source: Admin email
ku: ئیمەیڵی بەڕێوەبەر

# adminPasswordLabel
source: Password
ku: وشەی نهێنی

# adminPasswordHint
source: Enter your password
ku: وشەی نهێنیەکەت بنووسە

# adminSigningIn
source: Signing in...
ku: چوونەژوورەوە…

# adminEnterEmailPassword
source: Enter your admin email and password.
ku: ئیمەیڵ و وشەی نهێنی بەڕێوەبەرەکەت بنووسە.

# adminUnableToSignIn
source: Unable to sign in.
ku: چوونەژوورەوە سەرکەوتوو نەبوو.

# adminAccessRestricted
source: Access restricted
ku: دەستڕاگەیشتن سنووردارە

# adminNotRegisteredPrompt
source: This account is not registered as a super admin. To grant access, add a document in Firestore:
ku: ئەم هەژمارە وەک بەڕێوەبەری سەرەکی تۆمار نەکراوە. بۆ دەستڕاگەیشتن، بەڵگەنامەیەک زیاد بکە لە Firestore:

# adminFirestoreInstructions
source: Collection: admins Document ID: {uid}
ku: کۆکراوە: admins کۆدی بەڵگەنامە: {uid}

# adminFirestoreSteps
source: You can create an empty document in Firebase Console (Firestore → admins → Add document with the ID above). Then sign out and sign in again.
ku: دەتوانیت بەڵگەنامەیەکی بەتاڵ دروست بکەیت لە Firebase Console (Firestore → admins → بەڵگەنامەی زیاد بکە بە ئەو IDیەوە). دواتر دەرچوونەژوورەوە و دووبارە چوونەژوورەوە بکە.

# adminSignOut
source: Sign out
ku: دەرچوونەژوورەوە

# adminPendingApplications
source: Pending vendor applications
ku: داواکاری چاوەڕوانی فرۆشیاران

# adminAnalytics
source: Analytics
ku: شیکاری

# adminBouquetApproval
source: Bouquet Approval
ku: پەسەندکردنی دەستەگوڵ

# adminManageAddOns
source: Manage Add-ons
ku: بەڕێوەبردنی زیادەکان

# adminLoadingApplications
source: Loading applications…
ku: داواکاریەکان بار دەبن…

# adminUnableToLoadApplications
source: Unable to load applications.
ku: بارکردنی داواکاریەکان سەرکەوتوو نەبوو.

# adminNoPendingApplications
source: No pending applications.
ku: هیچ داواکاری چاوەڕوان نییە.
